--
-- модификаци€ squa_eq_2.gv
--
projectName = "squa_equ_2" 
--
local function Visual() -- визуализаци€ состо€ни€ яѕ‘
AddLineToTextFrame("=============================================================================")  
PutTiersToTextFrame() 
PutParamsTiers() 
ClearDiagrArea() 
DelayMS( -1  ) -- ждЄм 1 сек
DrawDiagrTiers()
DelayMS( -1  )
ClearDiagrArea() 
PutTLDToTextFrame() -- данные времени жизни данных
DrawDiagrTLD() -- вывести в виде линейчатой диаграммы
DelayMS( -1  )
end -- конец функции Visual()

--------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------

-- MAIN - функци€ -------------------------------------
--=================================
local H,iTier,j,nTiers,nOps,iOp, fromTier,toTier,newTier
--
ClearTextFrame() -- очистить текстовое окно
--
CreateTiersByEdges( projectName .. ".gv" ) -- создать яѕ‘ по »√ј
Visual() -- визуализаци€ состо€ни€ яѕ‘
--
MoveOpTierToTier( 100, 2 ) -- перемещение оператора 100 на €рус 2
Visual() -- визуализаци€ состо€ни€ яѕ‘
--
MoveOpTierToTier( 102, 3 ) -- перемещение оператора 102 на €рус 3
Visual() -- визуализаци€ состо€ни€ яѕ‘
--
SoundPlay("rooster.wav") -- петух возвещает, что работа сделана
--
-- конец main 

