//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit1.h" // для доступа к Unit1
#include "Unit2.h"
#include "Unit3.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TF2 *F2;

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
__fastcall TF2::TF2(TComponent* Owner) : TForm(Owner)
{ // выполняется прежде всего ( конструктор )
} //----------------------------------------------------------------------------

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
void __fastcall TF2::On_Resize(TObject *Sender)
{ // вызывается при изменении размеров формы F2
 int W = F1->Width, // взяли текущий размер главного окна F1 программы
     H = F1->Height,
     min_Width_F2  = 500, // ограничения по ширине текста, выводимого в окнр
     min_Height_F2 = 400; // отношение 2/3
// -----------------------------------------------------------------------------
 if( F2->Width < min_Width_F2 ) // превышать нельзя - может текст не поместиться..!
  F2->Width = min_Width_F2;
//
 if( F2->Height < min_Height_F2 )
  F2->Height = min_Height_F2;
//
} //----------------------------------------------------------------------------

